<template>
  <h5>{{ t('problemReport') }}</h5>
  <div>
    <p>
      Για τεχνικά θέματα και προβλήματα παρακαλούμε όπως υποβάλετε σχετικό
      δελτίο προβλήματος στην εφαρμογή «Help Desk – Βλάβες» (κατηγορία Λοιπές
      Εφαρμογές του μενού POL).
    </p>
    <p>Για τυχόν ελλείψεις σε μάρκες και μοντέλα απευθύνεστε στα παρακάτω:</p>
    <p>
      <strong>Email:</strong>
      d.texnikon@astynomia.gr
    </p>
    <p>
      <strong>Τηλέφωνα:</strong>
    </p>
    <p>ΤΜΗΜΑ ΤΕΧΝΙΚΩΝ ΜΕΣΩΝ & ΤΕΧΝΟΛΟΓΙΚΩΝ ΣΥΣΑΤΗΜΑΤΩΝ: 1042130 - 1042115</p>
    <p>ΤΜΗΜΑ ΜΕΤΑΦΟΡΙΚΩΝ ΜΕΣΩΝ: 1042123 - 1042212</p>
    <p>ΤΜΗΜΑ ΟΠΛΙΣΜΟΥ: 1042313</p>
    <p>ΤΜΗΜΑ ΚΤΗΡΙΟΛΟΓΙΚΗΣ ΥΠΟΔΟΜΗΣ: 1042415</p>
    <p>ΤΜΗΜΑ ΓΕΝΙΚΩΝ & ΑΤΟΜΙΚΩΝ ΕΦΟΔΙΩΝ: 1042300</p>
    <p>
      Ειδικά για υλικά τα οποία αφορούν Εξοπλισμό Πληροφορικής(π.χ κατηγορίες ΚΑΕ 22xxx,46xxx κτλ)
      θα απευθύνεστε στο Γραφείο διαχείρισης υλικού και
      Τεχνικής Υποστήριξης Εξοπλισμού Πληροφορικής Α.Ε.Α./ Δ-νση Πληροφορικής στο παρακάτω email: asset.management@astynomia.gr
    </p>
    <p>
      Ως προς τα υφιστάμενα υλικά (όχι καινούργια υλικά) και εφόσον αυτά έχουν χαρακτηρισθεί ως «διακριτά»,
      κατά την καταχώρηση τους και εφόσον δεν υπάρχει μοντέλο – μάρκα να εισάγετε η λέξη «ΑΓΝΩΣΤΟ»,
      ενώ στον σειριακό αριθμό να εισάγετε «ΑΝΕΥ ΑΜΥ ΥΠΗΡΕΣΙΑΣ ΓΕΝΙΚΟΥ ΔΙΑΧΕΙΡΙΣΤΗ 00000»,
      όπου θα λαμβάνει αύξων αριθμό, έκαστο υλικό χωρίς κενό
      (π.χ. για τη Γενική Διαχείριση με α/α 40 Διεύθυνση Τεχνικής Υποστήριξης : ΑΝΕΥ177400001, ΑΝΕΥ177400002, ΑΝΕΥ177400003 κ.ο.κ.)
    </p>
  </div>
</template>

<script setup lang="ts">
import { useI18n } from 'vue-i18n';

const { t } = useI18n();
</script>
