package gr.police.polseal.model;

public enum TransactionType {

  /*
  * Ποιες έχουν παραγόμενες
  * T00 -> T01
  * T04 -> T19
  * T05 -> T06
  * */
  T00("Αρχική Εγγραφή σε Γενική Διαχείριση (προμήθεια ή δωρεά ή κατάσχεση)"),
  T01("Διανομή από Γενική σε Μερική Διαχείριση"),
  T03("Ανακατανομή από Μερική σε Μερική Διαχείριση"),
  T04("Ανακατανομή από Γενική σε Γενική Διαχείριση"),
  T05("Διαγραφή από Γενική Διαχείριση"),
  T06("Διαγραφή από Μερική Διαχείριση"),
  T07("Χρέωση από Μερική Διαχείριση σε Υπάλληλο"),
  T08("Αποχρέωση από Υπάλληλο σε Μερική Διαχείριση"),
  T09("Χρέωση από Μερική Διαχείριση σε Τοπικό Υπεύθυνο Υπηρεσίας"),
  T10("Αρχική Απογραφή Γενικού Απολογιστικού Βιβλίου"),
  T11("Αρχική Απογραφή Μερικού Απολογιστικού Βιβλίου"),
  T12("Χρέωση από Τοπικό Υπεύθυνο Υπηρεσίας σε Υπάλληλο"),
  T13("Αποχρέωση από Τοπικό Υπεύθυνο Υπηρεσίας σε Μερική Διαχείριση"),
  T14("Αποχρέωση από Υπάλληλο σε Τοπικό Υπεύθυνο Υπηρεσίας"),
  T15("Χρέωση από Γενική Διαχείριση σε Υπάλληλο"),
  T16("Αποχρέωση από Υπάλληλο σε Γενική Διαχείριση"),
  T17("Χρέωση από Γενική Διαχείριση σε Τοπικό Υπεύθυνο Υπηρεσίας"),
  T18("Αποχρέωση από Τοπικό Υπεύθυνο Υπηρεσίας σε Γενική Διαχείριση"),
  T19("Αποχρέωση από Μερική σε Γενική Διαχείριση");

  private final String description;

  TransactionType(String description) {
    this.description = description;
  }

  public String getDescription() {
    return this.description;
  }

}
